/**
 *    author:  Abhishek Chauhan
 *    created: Fri Apr  8 21:00:23 IST 2022 
**
**/


/*कर्पूरगौरं- कर्पूर के समान गौर वर्ण वाले. करुणावतारं-
करुणा के जो साक्षात् अवतार हैं. संसारसारं- समस्त 
सृष्टि केजो सार हैं. भुजगेंद्रहारम्- इस शब्द का अर्थ है
जो सांप को हार के रूप में धारण करते हैं.*/
#include<bits/stdc++.h>
using namespace std;
void BhagWat_Geeta(){
        int sohan,mohan;
        cin>>sohan>>mohan;


        /*कर्पूरगौरं- कर्पूर के समान गौर वर्ण वाले. करुणावतारं-
करुणा के जो साक्षात् अवतार हैं. संसारसारं- समस्त 
सृष्टि केजो सार हैं. भुजगेंद्रहारम्- इस शब्द का अर्थ है
जो सांप को हार के रूप में धारण करते हैं.*/
        if(sohan==1 && mohan==1){
            cout<<"-1"<<endl;
        }else{
            int ans=__gcd(sohan, mohan);
            if(ans!=1){
                cout<<"0"<<endl;
            }else{


                /*कर्पूरगौरं- कर्पूर के समान गौर वर्ण वाले. करुणावतारं-
करुणा के जो साक्षात् अवतार हैं. संसारसारं- समस्त 
सृष्टि केजो सार हैं. भुजगेंद्रहारम्- इस शब्द का अर्थ है
जो सांप को हार के रूप में धारण करते हैं.*/
                cout<<"1"<<endl;
            }
        }

}
int32_t main() {
    int t;


    /*कर्पूरगौरं- कर्पूर के समान गौर वर्ण वाले. करुणावतारं-
करुणा के जो साक्षात् अवतार हैं. संसारसारं- समस्त 
सृष्टि केजो सार हैं. भुजगेंद्रहारम्- इस शब्द का अर्थ है
जो सांप को हार के रूप में धारण करते हैं.*/
    cin>>t;
    while(t--){
        BhagWat_Geeta();
    }
	return 0;


    /*कर्पूरगौरं- कर्पूर के समान गौर वर्ण वाले. करुणावतारं-
करुणा के जो साक्षात् अवतार हैं. संसारसारं- समस्त 
सृष्टि केजो सार हैं. भुजगेंद्रहारम्- इस शब्द का अर्थ है
जो सांप को हार के रूप में धारण करते हैं.*/
}