/**
 *    author:  Abhishek Chauhan
 *    created: Fri Apr  8 20:13:53 IST 2022 
**
**/


/*कर्पूरगौरं- कर्पूर के समान गौर वर्ण वाले. करुणावतारं-
करुणा के जो साक्षात् अवतार हैं. संसारसारं- समस्त 
सृष्टि केजो सार हैं. भुजगेंद्रहारम्- इस शब्द का अर्थ है
जो सांप को हार के रूप में धारण करते हैं.*/
#include<bits/stdc++.h>
using namespace std;
void BhagWat_Geeta(){
      int n;

      int op;
      cin>>n>>op;   




      /*कर्पूरगौरं- कर्पूर के समान गौर वर्ण वाले. करुणावतारं-
करुणा के जो साक्षात् अवतार हैं. संसारसारं- समस्त 
सृष्टि केजो सार हैं. भुजगेंद्रहारम्- इस शब्द का अर्थ है
जो सांप को हार के रूप में धारण करते हैं.*/
      long long arr[n];
      for(int i=0;i<n;i++)
      cin>>arr[i];
      



      /*कर्पूरगौरं- कर्पूर के समान गौर वर्ण वाले. करुणावतारं-
करुणा के जो साक्षात् अवतार हैं. संसारसारं- समस्त 
सृष्टि केजो सार हैं. भुजगेंद्रहारम्- इस शब्द का अर्थ है
जो सांप को हार के रूप में धारण करते हैं.*/
      sort(arr,arr+n);
      
      int dis=1; 
      vector<int>non; 



      /*कर्पूरगौरं- कर्पूर के समान गौर वर्ण वाले. करुणावतारं-
करुणा के जो साक्षात् अवतार हैं. संसारसारं- समस्त 
सृष्टि केजो सार हैं. भुजगेंद्रहारम्- इस शब्द का अर्थ है
जो सांप को हार के रूप में धारण करते हैं.*/
      for(int i=0;i<n-1;i++)
      {
          if(arr[i]!=arr[i+1])
          dis++;
          else
          non.push_back(arr[i]);
      }
      
      long int ans=dis;
   
      int non_dis=n-dis;





      /*कर्पूरगौरं- कर्पूर के समान गौर वर्ण वाले. करुणावतारं-
करुणा के जो साक्षात् अवतार हैं. संसारसारं- समस्त 
सृष्टि केजो सार हैं. भुजगेंद्रहारम्- इस शब्द का अर्थ है
जो सांप को हार के रूप में धारण करते हैं.*/
      


      int j=non.size()-1;   
      while(op!=0 && j>=0)
      {


        /*कर्पूरगौरं- कर्पूर के समान गौर वर्ण वाले. करुणावतारं-
करुणा के जो साक्षात् अवतार हैं. संसारसारं- समस्त 
सृष्टि केजो सार हैं. भुजगेंद्रहारम्- इस शब्द का अर्थ है
जो सांप को हार के रूप में धारण करते हैं.*/
          non.pop_back();
          op--;
          j--;
          ans++;
      }
      
      ans+=non.size();


      int i=0;
      while(i<non.size())
      {
          int k=1;
         



         /*कर्पूरगौरं- कर्पूर के समान गौर वर्ण वाले. करुणावतारं-
करुणा के जो साक्षात् अवतार हैं. संसारसारं- समस्त 
सृष्टि केजो सार हैं. भुजगेंद्रहारम्- इस शब्द का अर्थ है
जो सांप को हार के रूप में धारण करते हैं.*/
          while((i+1)<non.size() && non[i]==non[i+1])
          {
              k++;
              i++;
          }
     
          i++;
         
          ans=ans+(k-1);
      }
      cout<<ans<<endl;


/*कर्पूरगौरं- कर्पूर के समान गौर वर्ण वाले. करुणावतारं-
करुणा के जो साक्षात् अवतार हैं. संसारसारं- समस्त 
सृष्टि केजो सार हैं. भुजगेंद्रहारम्- इस शब्द का अर्थ है
जो सांप को हार के रूप में धारण करते हैं.*/

}
int32_t main() {
    int t;
    cin>>t;
    while(t--){
        BhagWat_Geeta();
    }
  return 0;
}