/**
 *    author:  Abhishek Chauhan
 *    created: Fri Apr  8 20:23:02 IST 2022
**
**/



/*कर्पूरगौरं- कर्पूर के समान गौर वर्ण वाले. करुणावतारं-
करुणा के जो साक्षात् अवतार हैं. संसारसारं- समस्त 
सृष्टि केजो सार हैं. भुजगेंद्रहारम्- इस शब्द का अर्थ है
जो सांप को हार के रूप में धारण करते हैं.*/
#include<bits/stdc++.h>
using namespace std;
void BhagWat_Geeta(){
        int apple,boy,cat;
        cin>>apple;
        cin>>boy;
        cin>>cat;



        /*कर्पूरगौरं- कर्पूर के समान गौर वर्ण वाले. करुणावतारं-
करुणा के जो साक्षात् अवतार हैं. संसारसारं- समस्त 
सृष्टि केजो सार हैं. भुजगेंद्रहारम्- इस शब्द का अर्थ है
जो सांप को हार के रूप में धारण करते हैं.*/
        if((apple*cat)<boy)
        {
            cout<<"YES"<<endl;
        }
        else
        {
            cout<<"NO"<<endl;       
        }

        /*कर्पूरगौरं- कर्पूर के समान गौर वर्ण वाले. करुणावतारं-
करुणा के जो साक्षात् अवतार हैं. संसारसारं- समस्त 
सृष्टि केजो सार हैं. भुजगेंद्रहारम्- इस शब्द का अर्थ है
जो सांप को हार के रूप में धारण करते हैं.*/

}
int32_t main() {
    int t;
    cin>>t;
    while(t--){


/*कर्पूरगौरं- कर्पूर के समान गौर वर्ण वाले. करुणावतारं-
करुणा के जो साक्षात् अवतार हैं. संसारसारं- समस्त 
सृष्टि केजो सार हैं. भुजगेंद्रहारम्- इस शब्द का अर्थ है
जो सांप को हार के रूप में धारण करते हैं.*/
        BhagWat_Geeta();
    }
    return 0;
}

/*कर्पूरगौरं- कर्पूर के समान गौर वर्ण वाले. करुणावतारं-
करुणा के जो साक्षात् अवतार हैं. संसारसारं- समस्त 
सृष्टि केजो सार हैं. भुजगेंद्रहारम्- इस शब्द का अर्थ है
जो सांप को हार के रूप में धारण करते हैं.*/