
/**
 *    author:  Abhishek Chauhan
 *    created: Fri Apr  8 20:49:01 IST 2022 
**
**/

/*कर्पूरगौरं- कर्पूर के समान गौर वर्ण वाले. करुणावतारं-
करुणा के जो साक्षात् अवतार हैं. संसारसारं- समस्त 
सृष्टि केजो सार हैं. भुजगेंद्रहारम्- इस शब्द का अर्थ है
जो सांप को हार के रूप में धारण करते हैं.*/
#include<bits/stdc++.h>
#define ll long long
using namespace std;
void BhagWat_Geeta(){
    ll Lohar;


    /*कर्पूरगौरं- कर्पूर के समान गौर वर्ण वाले. करुणावतारं-
करुणा के जो साक्षात् अवतार हैं. संसारसारं- समस्त 
सृष्टि केजो सार हैं. भुजगेंद्रहारम्- इस शब्द का अर्थ है
जो सांप को हार के रूप में धारण करते हैं.*/
    cin>>Lohar;
    if(Lohar%4==0) cout<<Lohar+3<<endl;



    /*कर्पूरगौरं- कर्पूर के समान गौर वर्ण वाले. करुणावतारं-
करुणा के जो साक्षात् अवतार हैं. संसारसारं- समस्त 
सृष्टि केजो सार हैं. भुजगेंद्रहारम्- इस शब्द का अर्थ है
जो सांप को हार के रूप में धारण करते हैं.*/
    else if (Lohar%4==1) cout<<Lohar<<endl;





    /*कर्पूरगौरं- कर्पूर के समान गौर वर्ण वाले. करुणावतारं-
करुणा के जो साक्षात् अवतार हैं. संसारसारं- समस्त 
सृष्टि केजो सार हैं. भुजगेंद्रहारम्- इस शब्द का अर्थ है
जो सांप को हार के रूप में धारण करते हैं.*/
    else cout<<"3"<<endl;
}

/*कर्पूरगौरं- कर्पूर के समान गौर वर्ण वाले. करुणावतारं-
करुणा के जो साक्षात् अवतार हैं. संसारसारं- समस्त 
सृष्टि केजो सार हैं. भुजगेंद्रहारम्- इस शब्द का अर्थ है
जो सांप को हार के रूप में धारण करते हैं.*/
int32_t main() {
    int t;
    cin>>t;

    /*कर्पूरगौरं- कर्पूर के समान गौर वर्ण वाले. करुणावतारं-
करुणा के जो साक्षात् अवतार हैं. संसारसारं- समस्त 
सृष्टि केजो सार हैं. भुजगेंद्रहारम्- इस शब्द का अर्थ है
जो सांप को हार के रूप में धारण करते हैं.*/
    while(t--){
        BhagWat_Geeta();


        /*कर्पूरगौरं- कर्पूर के समान गौर वर्ण वाले. करुणावतारं-
करुणा के जो साक्षात् अवतार हैं. संसारसारं- समस्त 
सृष्टि केजो सार हैं. भुजगेंद्रहारम्- इस शब्द का अर्थ है
जो सांप को हार के रूप में धारण करते हैं.*/
    }
    return 0;
}

/*कर्पूरगौरं- कर्पूर के समान गौर वर्ण वाले. करुणावतारं-
करुणा के जो साक्षात् अवतार हैं. संसारसारं- समस्त 
सृष्टि केजो सार हैं. भुजगेंद्रहारम्- इस शब्द का अर्थ है
जो सांप को हार के रूप में धारण करते हैं.*/